ec2-galera/old/percona-standalone/add_2_3120.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            925778
        write:                           330635
        other:                           132254
        total:                           1388667
    transactions:                        66127  (21.19 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 1256413 (402.69 per sec.)
    other operations:                    132254 (42.39 per sec.)

Test execution summary:
    total time:                          3120.0200s
    total number of events:              66127
    total time taken by event execution: 6239.3453
    per-request statistics:
         min:                                 18.73ms
         avg:                                 94.35ms
         max:                                821.20ms
         approx.  95 percentile:             233.65ms

Threads fairness:
    events (avg/stddev):           33063.5000/4.50
    execution time (avg/stddev):   3119.6727/0.01