ec2-galera/old/percona-standalone/add_2_960.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            151648
        write:                           54160
        other:                           21664
        total:                           227472
    transactions:                        10832  (11.28 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 205808 (214.36 per sec.)
    other operations:                    21664  (22.56 per sec.)

Test execution summary:
    total time:                          960.0853s
    total number of events:              10832
    total time taken by event execution: 1920.0464
    per-request statistics:
         min:                                 19.06ms
         avg:                                177.26ms
         max:                                832.13ms
         approx.  95 percentile:             325.65ms

Threads fairness:
    events (avg/stddev):           5416.0000/13.00
    execution time (avg/stddev):   960.0232/0.00